[
    {
        "id": 1,
        "title": "The Lighthouse",
        "director": "Robert Eggers",
        "lead_actors": ["Willem Dafoe", "Robert Pattinson", "Valeriia Karaman"],
        "genres": ["Horror", "Thriller", "Mystery", "Drama"],
        "youtube": "42_UHhpq530",
        "poster": "https://m.media-amazon.com/images/I/61zFh8+gdrL.jpg",
        "runtime": 110,
        "release_year": 2019,
        "rating": 9.5,
        "review": "Easily a top 10 movie that I have ever seen. The black and white emphasizes the dread that overshadows the entire movie and is the perfect touch. The acting from Pattinson and Dafoe is sublime, with Dafoe giving one of the best monologues in cinema history. Watch two men descend into madness as they are overtaken by the solemn embrace of a godforsaken rock."
    },
    {
        "id": 2,
        "title": "Elvis",
        "director": "Baz Luhrmann",
        "lead_actors": ["Austin Butler", "Tom Hanks", "Olivia DeJonge"],
        "genres": ["Musical", "Drama"],
        "youtube": "wBDLRvjHVOY",
        "poster": "https://m.media-amazon.com/images/I/814DOk-0i3L.jpg",
        "runtime": 159,
        "release_year": 2022,
        "rating": 5.1,
        "review": "Austin Butler saves what is otherwise an unwatchable movie. Hyper-stylized, ultra-fast paced, very long, and does very little for character development. Complete overstimulation, and all narrated by one of the worst accents I have ever heard. It's one of those movies you think you've been watching for over an hour but it's only been twenty-five minutes. And it's nearly three hours long."
    },
    {
        "id": 3,
        "title": "Dunkirk",
        "director": "Christopher Nolan",
        "lead_actors": ["Harry Styles", "Fionn Whitehead", "Cilian Murphy", "Tom Hardy"],
        "genres": ["Drama", "Action", "Thriller"],
        "youtube": "F-eMt3SrfFU",
        "poster": "https://m.media-amazon.com/images/I/91a9Ez60pmL.jpg",
        "runtime": 106,
        "release_year": 2017,
        "rating": 9.1,
        "review": "A masterclass in WWII storytelling. The sense of dread and the largely unspoken struggle for survival is completely engrossing as a viewer. Watch this without distractions and sit with the idea that 400,000 real soldiers stood at Dunkirk without any known esacape as axis powers closed in. Chilling, and amazing."
    },
    {
        "id": 4,
        "title": "Eyes Wide Shut",
        "director": "Stanley Kubrick",
        "lead_actors": ["Tom Cruise", "Nicole Kidman", "Sydney Pollack"],
        "genres": ["Drama", "Thriller", "Mystery"],
        "youtube": "FBrbQSDfh7Q",
        "poster": "https://m.media-amazon.com/images/I/71sBKgKXOzL.jpg",
        "runtime": 165,
        "release_year": 1999,
        "rating": 8.4,
        "review": "Kubrick alwasy delivers on creepy and unsettling. Exploring the perverse desires of both the elite and in the midst of our own bedrooms, this film delivers one of the most bizarre and compelling scenes ever with 'the party'. Kidman stands out in her deviant delivery of Alice, and the antagonist known only as 'Red Cape' will live in your memory."
    },
    {
        "id": 5,
        "title": "Eastern Promises",
        "director": "David Cronenberg",
        "lead_actors": ["Viggo Mortensen", "Naomi Watts", "Vincent Castle"],
        "genres": ["Drama", "Action"],
        "youtube": "gAhz9OnL8Ps",
        "poster": "https://m.media-amazon.com/images/M/MV5BMTcwMzU0OTY3NF5BMl5BanBnXkFtZTYwNzkwNjg2._V1_.jpg",
        "runtime": 100,
        "release_year": 2007,
        "rating": 8.2,
        "review": "An interesting take on organized crime channeled through the Russian mob. Though generally slower than your avergae mob movie, it feels comfortably paced, taking time to reflect on diasporic dynamics of Russian immigrants in America. Viggo Mortensen is a star in this role as well, absolutely deserved an Oscar."
    },
    {
        "id": 6,
        "title": "Howl's Moving Castle",
        "director": "Hayao Miyazaki",
        "lead_actors": ["Christian Bale", "Jean Simmons", "Patton Oswalt"],
        "genres": ["Drama", "Fantasy", "Action"],
        "youtube": "iwROgK94zcM",
        "poster": "https://i.ebayimg.com/images/g/h9oAAOSw0BJgHam1/s-l1600.jpg",
        "runtime": 119,
        "release_year": 2005,
        "rating": 8.9,
        "review": "What more can be said about this classic Miyazaki film? Fantastic, absurd, sweet, and incomporably animated. Even the wicked witch's grotesque features are animated in a way only Ghibli can. Sophie's character gives us insight into the changes we incur as we age, Calcifer reminds us to keep our passions burning, and Howl reminds us to hold onto youthful idealism. Wonderful movie."
    },
    {
        "id": 7,
        "title": "The Northman",
        "director": "Robert Eggers",
        "lead_actors": ["Alexander Skarsgård", "Anya Taylor-Joy", "Nicole Kidman"],
        "genres": ["Drama", "Thriller", "Action"],
        "youtube": "oMSdFM12hOw",
        "poster": "https://m.media-amazon.com/images/M/MV5BMzVlMmY2NTctODgwOC00NDMzLWEzMWYtM2RiYmIyNTNhMTI0XkEyXkFqcGdeQXVyNTAzNzgwNTg@._V1_.jpg",
        "runtime": 137,
        "release_year": 2022,
        "rating": 8.2,
        "review": "Not for the faint of heart. This movie will test your limits in what you can handle with gore and disturbing imagery. If you can get through that, Eggers delivers a great full-circle hero bent on vengeance story. Incorporating old Viking religion and feudal slave/master dynamics, this is a no holds barred approach to ancient Nordic storytelling."
    },
    {
        "id": 8,
        "title": "Nightmare on Elm Street",
        "director": "Wes Craven",
        "lead_actors": ["Johnny Depp", "Robert Englund", "Heather Langencamp"],
        "genres": ["Horror", "Thriller"],
        "youtube": "dCVh4lBfW-c",
        "poster": "https://m.media-amazon.com/images/I/61CsXp-qnnL.jpg",
        "runtime": 91,
        "release_year": 1984,
        "rating": 8.6,
        "review": "A horror classic that still holds its weight in the current day. Though Freddie may not be the most overwhelming physical villain, his grotesque face and creepy aesthetic while haunting dreams will put anyone on edge. It's also fun to see an early Johnny Depp, and the death scenes must have been groundbreaking for their time."
    },
    {
        "id": 9,
        "title": "The Alpinist",
        "director": "Peter Mortimer & Nick Rosen",
        "lead_actors": ["Marc-André Leclerc", "Alex Honnold", "Peter Mortimer"],
        "genres": ["Documentary"],
        "youtube": "SRpVyzagXLQ",
        "poster": "https://m.media-amazon.com/images/M/MV5BN2M1MzNkMjAtZWNmNy00NjA5LTk0MjAtYjkwOWYwZjliZGUzXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg",
        "runtime": 93,
        "release_year": 2021,
        "rating": 9.1,
        "review": "A gorgeous and unsettling documentary about a man devoid of fear in some of the most unforgiving environments where he scales rock and ice without a rope. MAL was soloing unfathomably dangerous climbs, not for clout, but for the true connection with nature. The man lived a short time, but it was to serve a specific purpose. It's easy to be inspired by someone so singularly driven in life. Prepare to have your jaw on the floor with some of these camera shots."
    },
    {
        "id": 10,
        "title": "2001: A Space Odyssey",
        "director": "Stanley Kubrick",
        "lead_actors": ["Keir Duella", "Gary Lockwood", "William Sylvester"],
        "genres": ["Science Fiction", "Fantasy", "Mystery"],
        "youtube": "oR_e9y-bka0",
        "poster": "https://cdn.shopify.com/s/files/1/0057/3728/3618/products/3a5fab5b25467f2ebe4f1db84ebc9e37_78e7db80-49f2-4f9e-8c5e-edcaef03b89a_500x.jpg?v=1573613645",
        "runtime": 139,
        "release_year": 1968,
        "rating": 8.8,
        "review": "Quiet, contemplative, and deeply critical about the direction of the human race, Kubrick's finest film still challenges its new viewers like it was a brand new film. HAL's voice will linger in my head forever, as will the last third of this movie, which should be only known through an actual viewing rather than being described here."
    },
    {
        "id": 11,
        "title": "The Master",
        "director": "Paul Thomas Anderson",
        "lead_actors": ["Joaquin Phoenix", "Philip Seymour Hoffman", "Amy Adams"],
        "genres": ["Drama"],
        "youtube": "-EGSWpBDbho",
        "poster": "https://m.media-amazon.com/images/M/MV5BMTQ2NjQ5MzMwMF5BMl5BanBnXkFtZTcwMjczNTAzOA@@._V1_.jpg",
        "runtime": 144,
        "release_year": 2012,
        "rating": 8.3,
        "review": "A candid portrait of a what a vulnerable, directionless person is capable of believing. Joaquin Phoenix and PSH are perfect together in this dynamic, and PSH delivers as a deluded, narcissistic cult leader who has created his own reality around him. With obvious overtures to Scientology, this movie is biting yet compassionate to all the characters and their personal weaknesses"
    },
    {
        "id": 12,
        "title": "Scarface",
        "director": "Brian De Palma",
        "lead_actors": ["Al Pacino", "Michelle Pfeiffer", "Steven Bauer"],
        "genres": ["Drama", "Action"],
        "youtube": "7pQQHnqBa2E",
        "poster": "https://m.media-amazon.com/images/I/41-Wj-Z8DnL._AC_.jpg",
        "runtime": 170,
        "release_year": 1983,
        "rating": 8.7,
        "review": "A masterclass in film pacing, Scarface keeps you glues to your seat for all 2 hours and 50 minutes. Showing the rise and fall of an antisocial narcissist devoid of fear and hungry for power, this movie shows humanity at its utmost corruptible. Pacino is enthralling, and the backdrop of 1980's Miami at the height of the cocaine trade creates an environment within an organized crime movie unlike any other."
    },
    {
        "id": 13,
        "title": "Interstellar",
        "director": "Christopher Nolan",
        "lead_actors": ["Matthew McConaughey", "Anne Hathaway", "Jessica Chastain", "Matt Damon"],
        "genres": ["Drama", "Science Fiction", "Fantasy"],
        "youtube": "2LqzF5WauAw",
        "poster": "https://m.media-amazon.com/images/I/71LNVGVpWYL.jpg",
        "runtime": 169,
        "release_year": 2014,
        "rating": 9.6,
        "review": "Holy Shit"
    },
    {
        "id": 14,
        "title": "The Wrestler",
        "director": "Darren Aranofsky",
        "lead_actors": ["Mickey Rourke", "Marisa Tomei", "Evan Rachel Wood"],
        "genres": ["Drama"],
        "youtube": "61-GFxjTyV0",
        "poster": "https://s3.superluchas.com/2020/08/the-wrestler-poster-1-1-1024x1536.jpg",
        "runtime": 110,
        "release_year": 2008,
        "rating": 8.4,
        "review": "A candid and sad look at the plight of many Americans looking for direction purpose in a world that seeks to leave them behind. Mickey Rourke is incredible in this role at showing the existential pain of the divide between Randy the man and 'The Ram'. As age and abuse on his body threaten his ability to stay in the ring, we watch his struggle with adapting to the real world and reconciling with aspects of his past and present he could continually neglect at 'The Ram'. Sad, often unreedeming, but strikingly real and heartfelt. Aronofsky knocked it out of the park."
    },
    {
        "id": 15,
        "title": "Pig",
        "director": "Michael Sarnoski",
        "lead_actors": ["Nicolas Cage", "Alex Wolff", "Adam Arkin"],
        "genres": ["Drama"],
        "youtube": "gH6vhlNTLUk",
        "poster": "https://m.media-amazon.com/images/M/MV5BOTc2NjRmN2QtMGY1Ny00MTc2LWJmMWUtZmViOTkyNjk2NGExXkEyXkFqcGdeQXVyNzg5MzIyOA@@._V1_.jpg",
        "runtime": 90,
        "release_year": 2021,
        "rating": 7.1,
        "review": "A unique film that hits points of emotional resonance about love and loss, but ultimately misses the mark for me. There wasn't enough to keep me engaged with the slower-moving plot, despite solid performances from Cage and Arkin. One can easily understand the impetus of Cage's actions borne of love for his pet, and the lack of violence to drive the plot forward is a compelling directoral decision. Ultimately, the down-the-pipe story and lack on meaningful plot events kept me from liking this movie more. Worth your time though, as there are many who love this film, and to each their own."
    },
    {
        "id": 16,
        "title": "Thank You for Smoking",
        "director": "Jason Reitman",
        "lead_actors": ["Aaron Eckhart", "JK Simmons", "Maria Bello", "Katie Holmes"],
        "genres": ["Comedy"],
        "youtube": "Df32RijORLo",
        "poster": "https://m.media-amazon.com/images/I/71J6cJpPgCL.jpg",
        "runtime": 92,
        "release_year": 2006,
        "rating": 8.6,
        "review": "Dark, bitingly cynical, and terrifying in its implications, this is an excellent comedy approaching a divisive issue from a different standpoint. Aaron Eckhart is perfect for the role as the ultimate spin artist, demonstrating the power of twisting a narrative in all aspect of American life, especially in the realm of public health. Compact and direct in its comedy, Thank You for Smoking was one of the better comedies I've seen in the past few years. Reccommended for anyone, even the most vehement anti-smokers."
    },
    {
        "id": 17,
        "title": "Nope",
        "director": "Jordan Peele",
        "lead_actors": ["Daniel Kaluuya", "Keke Palmer", "Steven Yeun"],
        "genres": ["Horror", "Thriller"],
        "youtube": "In8fuzj3gck",
        "poster": "https://www.syfy.com/sites/syfy/files/styles/scale--1200/public/2022/03/npe_adv1sht_1080x1920pxh_rgb_1.jpg",
        "runtime": 130,
        "release_year": 2022,
        "rating": 7.5,
        "review": "Had this review been based on the first 75% of the movie, the rating would be higher. Peele does a great job of incorporating suspense and creepy cinematic strategies throughout the majority of the movie. But, every monster movie needs to have a compelling monster, and Nope fails to deliver one. Once the true nature of the monster is revealed, the final showdown is boring, unsuspenseful, and the resolution of the movie being 'We got the photo' just didn't do it for me. There are elements of Peele's excellent direction that are on display here, but I think any of his other movies emphasize these skills much better. That being said, Kaluuya and Palmer are both great, and you can never go wrong with Steven Yeun (we miss you Glen)."
    },
    {
        "id": 18,
        "title": "Decision to Leave",
        "director": "Park Chan-wook",
        "lead_actors": ["Tang Wei", "Hae Il Park", "Lee Jung-hyun"],
        "genres": ["Drama", "Mystery"],
        "youtube": "Bmoy73lhs-s",
        "poster": "https://m.media-amazon.com/images/M/MV5BOTEzYTljMTMtODU0ZC00ZWI0LTlhOGEtYjE3MjI3NTI1YmNhXkEyXkFqcGdeQXVyNjgxODk1MTM@._V1_.jpg",
        "runtime": 138,
        "release_year": 2022,
        "rating": 8.9,
        "review": "There are so many things to unpack in this film. First, it is exquisitely shot, gorgeous in every scene. Both the main characters are complex and irrational, flawed and yet endearing in their cursed affair. Tang Wei is brilliant in her femme fatale role, never revelaing too much about her true intentions, and yet is vulnerable in the presence of Hae Il Park. Park shows what it means to be morally compromised, showing the agony of his affectation for his suspenct. The interplay between the two drives the film to new levels, and the conclusion leaves the audience unsatisfied in the most appropriate way. An absolute bombshell of a film despite its slow pace, and compelling in every line of unwasted dialogue."
    },
    {
        "id": 19,
        "title": "Sideways",
        "director": "Alexander Payne",
        "lead_actors": ["Paul Giamatti", "Thomas Hayden Church", "Sandra Oh", "Virginia Madsen"],
        "genres": ["Drama", "Comedy"],
        "youtube": "DGP8PwCpxLk",
        "poster": "https://m.media-amazon.com/images/I/51cupW89ErL._AC_UF894,1000_QL80_.jpg",
        "runtime": 126,
        "release_year": 2004,
        "rating": 9.2,
        "review": "A brilliant buddy comedy that reflects on the pain of life post-divorce and the value of fidelity, not only in your partner, but in your friends as well. All of this is channeled through the craft of wine, which acts as a catalyst for the plot to continue to develop. My favorite scene is when Virginia Madsen asks Giamatti why he likes Pinot Noir so much, to which he responds something like 'Pinot is hard to grow. It's temperamental, thin-skinned, ripens early, is unforgiving when handled incorrectly. But, when it's given the proper care and attention, and patience to grow just right, it can reveal magnificent things and reach its fullest potential'. The man was doublespeaking about himself and it revealed the amazing quality of the adapted screnplay, which won the Oscar in '04. Raucously funny in addition to jarringly real, a real treat of a movie."
    },
    {
        "id": 20,
        "title": "The Silence of the Lambs",
        "director": "Jonathan Demme",
        "lead_actors": ["Anthony Hopkins", "Jodie Foster", "Ted Levine"],
        "genres": ["Horror", "Thriller"],
        "youtube": "W6Mm8Sbe__o",
        "poster": "https://m.media-amazon.com/images/M/MV5BNjNhZTk0ZmEtNjJhMi00YzFlLWE1MmEtYzM1M2ZmMGMwMTU4XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg",
        "runtime": 130,
        "release_year": 1991,
        "rating": 8.5,
        "review": "Eminently creepy, this movie offers a deep dive into the twisted mindset of psychopathy. It was fascinating to see the character that would eventually lead to so many spinoff shows and movies. None are comparable to Hopkins though, as he delivers one of the most bone-chilling, unsettling, and convicted villian performances you'll ever see. This is not to overshadow Ted Levine as Buffalo Bill, not as cunning and devious as Lector, but equally as twisted. As Clarice, Jodie Foster delivers on the balance of naïvete and courage in the face of such evil. This is a classic horror movie for a reason."
    },
    {
        "id": 21,
        "title": "The Green Knight",
        "director": "David Lowery",
        "lead_actors": ["Dev Patel", "Barry Keoghan", "Alicia Vikander"],
        "genres": ["Fantasy", "Mystery"],
        "youtube": "VoJc2tH3WBw",
        "poster": "https://m.media-amazon.com/images/M/MV5BMjMxNTdiNWMtOWY0My00MjM4LTkwNzMtOGI0YThhN2Q4M2I4XkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg",
        "runtime": 125,
        "release_year": 2021,
        "rating": 6.8,
        "review": "Interesting, but slow. It feels like so much was left on the table with this movie. There are cetain times when exposition can ruin the subtle nuance of a film, but in this case, so little is understood even at the end of the movie that it detracts from the total experience. In ym view, The Green Knight is indicative of the test of every man's honor, especially in the response of `why should there be?` to the question of `is that really all there is?`. But, despite Dev Patel playing the role well, the film never truly engendered the audience to the main character, and every movement in the film is stacked with symbolism that you would need a readalong pamphlet to digest in real time. Unfortunate. I really wanted to love this movie."
    } 
]
